{
  "backend/main.mo": "Motoko canister implementing per-user profiles and link CRUD with access control checks.",
  "feature_evidence.json": "Defines feature evidence for dark theme enforcement and removal of scroll-based visual effects.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Global Tailwind CSS setup defining dark theme color tokens and base styles.",
  "frontend/index.html": "Base HTML shell mounting the React application.",
  "frontend/src/App.tsx": "Main React app handling authentication, dark mode enforcement, and rendering the link library UI.",
  "frontend/src/components/auth/AuthControls.tsx": "Authentication button component handling sign-in/out with Internet Identity.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to enter a name and save their profile.",
  "frontend/src/components/common/ConfirmDialog.tsx": "Reusable confirmation dialog for destructive link actions with loading state.",
  "frontend/src/components/layout/GameMenuLayout.tsx": "Layout wrapper with background image and solid overlay ensuring consistent dark appearance.",
  "frontend/src/components/link-library/EditLinkDialog.tsx": "Dialog component for editing an existing link, handling validation and updating via useUpdateLink.",
  "frontend/src/components/link-library/LinkForm.tsx": "Form for adding new links with validation and submission through useAddLink.",
  "frontend/src/components/link-library/LinkLibraryPanel.tsx": "Loads all links and renders the link form and list, handling loading and error states.",
  "frontend/src/components/link-library/LinkList.tsx": "Displays a scrollable list of saved links with actions to open, edit, or delete each one.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity loading, and related status flags.",
  "frontend/src/hooks/useLinks.ts": "React Query hooks for fetching, adding, updating, and deleting links through the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for retrieving and saving the authenticated user’s profile via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and permanent dark theme CSS variables with enforced black background, white foreground, and smooth focus/transition styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/validateUrl.ts": "Validates URLs for required protocol and domain format, returning specific error messages.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project state, requirements, issues, and architectural notes for a desktop link‑library app with a fixed dark theme."
}