{
  "backend/main.mo": "Actor canister handling per-user profiles and link CRUD with access control and migration integration.",
  "backend/migration.mo": "Migration utility upgrading stored links to include new image and color fields.",
  "feature_evidence.json": "Feature evidence report mapping features to modified frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components and utilities.",
  "frontend/index.css": "Tailwind-based global dark theme styles defining OKLCH color variables and base layout rules.",
  "frontend/index.html": "Root HTML document loading the React app and mounting it into the page.",
  "frontend/src/App.tsx": "Main app component handling auth, profile setup flow, and rendering the link library UI within the themed layout.",
  "frontend/src/components/auth/AuthControls.tsx": "Sign‑in/out control using Internet Identity with loading states and react-query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first‑time users to save their profile name with validation and submit handling.",
  "frontend/src/components/common/ConfirmDialog.tsx": "Confirmation dialog that triggers link deletion using useDeleteLink and shows a loading state.",
  "frontend/src/components/layout/GameMenuLayout.tsx": "Layout wrapper that renders children over a fixed background image with an overlay.",
  "frontend/src/components/link-library/EditLinkDialog.tsx": "Dialog for editing an existing link, handling URL validation, image uploads, color selection, and submitting updates.",
  "frontend/src/components/link-library/LinkForm.tsx": "Form for creating new links with URL validation, optional image upload, and color selection using useAddLink.",
  "frontend/src/components/link-library/LinkLibraryPanel.tsx": "Main panel that loads all links, displays loading/error states, and shows the add-link form and tile grid.",
  "frontend/src/components/link-library/LinkList.tsx": "Scrollable list view of links with actions to open, edit, or delete each item using dialogs.",
  "frontend/src/components/link-library/LinkTile.tsx": "Grid tile component showing a link’s image or initials with hover actions to edit or delete.",
  "frontend/src/components/link-library/LinkTileGrid.tsx": "Responsive grid layout that displays LinkTile components or an empty-state message.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state, login, logout, and status handling.",
  "frontend/src/hooks/useLinks.ts": "React Query hooks for fetching, adding, updating, and deleting link records through the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for loading and saving the authenticated user's profile via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining the dark theme and global styling.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and the Internet Identity provider.",
  "frontend/src/utils/linkPersonalization.ts": "Utility functions for link color presets, avatar initials, file-to-data-URL conversion, and tile color styling.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/src/utils/validateUrl.ts": "Validates URL strings, enforcing protocol and domain rules and returning descriptive errors.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, typography, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing features, issues, and architectural notes for the link‑library application."
}