{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Per-link personalization (image/color) and app-like link tiles with stable IDs",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Use backend-provided stable link ids for edit/delete identity throughout the UI.",
      "acceptanceCriteria": [
        "Frontend uses the backend-provided id for edit and delete actions (no URL-as-ID and no index keys for identity).",
        "Editing a link updates the intended saved item even if the URL changes, and deleting a link deletes the intended saved item."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLinks.ts",
          "operation": "modify",
          "description": "Update link fetching types to consume backend link entries that include a stable id (use LinkResponse from the generated backend types) and ensure hooks expose id + link payload to the UI."
        },
        {
          "path": "frontend/src/components/link-library/LinkLibraryPanel.tsx",
          "operation": "modify",
          "description": "Update the link library container to pass the id-aware link entries down to the rendering component(s) instead of plain Link[] so downstream edit/delete actions can use stable ids."
        },
        {
          "path": "frontend/src/components/common/ConfirmDialog.tsx",
          "operation": "modify",
          "description": "Change the confirmation dialog prop from linkUrl to linkId and invoke deletion with the stable id."
        },
        {
          "path": "frontend/src/components/link-library/EditLinkDialog.tsx",
          "operation": "modify",
          "description": "Adjust the dialog props to include the stable link id and use it in the update flow (remove URL-as-ID behavior)."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Extend the Add Link form with optional image upload + preview/clear and a common-color selector, and submit these fields when creating a link.",
      "acceptanceCriteria": [
        "The Add Link UI includes an optional image input (file upload) and a color selector with a set of common colors.",
        "On submit, the created link includes the selected image (as text) and selected color (as text) when provided.",
        "If no image is selected, link creation still works and the image field is absent/empty (no validation error).",
        "If an image is selected, the UI shows a small preview before submission and provides a way to clear/replace it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/link-library/LinkForm.tsx",
          "operation": "modify",
          "description": "Add optional image file input that converts the chosen file to text (e.g., a data URL) for submission, show a small preview, and add a clear/replace control; also add a common-color selector and include optional image/color fields in the addLink payload."
        },
        {
          "path": "frontend/src/utils/linkPersonalization.ts",
          "operation": "create",
          "description": "Add small utilities for link personalization (e.g., convert file to text for storage, define the common color set, and normalize/validate color strings) to keep form and tile UI logic consistent."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Allow editing/removing a link image and changing the link color in the Edit Link dialog, persisting via the existing update flow.",
      "acceptanceCriteria": [
        "The Edit Link dialog displays the current image (if any) and current color (if any) and allows updating both.",
        "Users can remove an existing image (set it back to none) and save successfully.",
        "Saving changes updates the correct link record using its stable id."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/link-library/EditLinkDialog.tsx",
          "operation": "modify",
          "description": "Add image preview + replace/remove controls and a common-color selector, initialized from the existing link data; submit updated optional image/color values via the update flow using the stable id."
        },
        {
          "path": "frontend/src/utils/linkPersonalization.ts",
          "operation": "modify",
          "description": "Share common-color options and image-text conversion helpers with the edit dialog so add/edit behaviors match."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Render saved links as compact app-like tiles with image-or-initials fallback and visible per-link color styling in the dark theme.",
      "acceptanceCriteria": [
        "The link library renders saved links as compact tiles (grid or similarly minimized layout) instead of only a full-width list row layout.",
        "Each tile displays the link image if present; otherwise it displays a fallback derived from the title (e.g., first letter(s)) in a visually centered avatar area.",
        "The selected per-link color is visibly applied to the tile (e.g., background/accent/border) while keeping text legible in the app’s permanently dark theme.",
        "Open/edit/delete actions remain available for each saved link in the tile view."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/link-library/LinkTileGrid.tsx",
          "operation": "create",
          "description": "Create a tile-grid renderer for id-aware link entries that displays a compact square tile per link, showing the image when provided and otherwise a title-derived fallback avatar; apply the stored per-link color as a tile accent/background/border while preserving legibility in the permanent dark theme."
        },
        {
          "path": "frontend/src/components/link-library/LinkTile.tsx",
          "operation": "create",
          "description": "Create a reusable tile component encapsulating open/edit/delete actions, image rendering, fallback avatar from title, and per-link color styling for consistent behavior across the grid."
        },
        {
          "path": "frontend/src/components/link-library/LinkLibraryPanel.tsx",
          "operation": "modify",
          "description": "Wire the new tile view into the existing authenticated link library UI by rendering LinkTileGrid in place of the current list view (no new routes/pages)."
        },
        {
          "path": "frontend/src/utils/linkPersonalization.ts",
          "operation": "modify",
          "description": "Add helpers for deriving fallback initials from the title and for mapping stored color text to safe, legible tile styling choices suitable for the permanent dark theme."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add hover and keyboard-focus interactions to link tiles (elevation/highlight and optional quick actions) without breaking accessibility.",
      "acceptanceCriteria": [
        "Hovering over a tile changes its appearance (e.g., subtle scale, border/outline, shadow, or background shift) to clearly indicate interactivity.",
        "The same interactive affordance is available via keyboard focus (focus-visible styles), and hover effects do not interfere with click targets.",
        "Tiles remain clickable to open the link, and action buttons remain reachable and usable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/link-library/LinkTile.tsx",
          "operation": "modify",
          "description": "Implement desktop hover styles (e.g., subtle elevation/outline/scale) paired with focus-visible styles for keyboard parity; ensure action buttons remain reachable and that hover effects do not overlap or reduce click target accessibility."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed, add minimal global styling adjustments to support consistent focus-visible/transition behavior for the tile interactions while keeping the app permanently dark and avoiding any scroll-dependent color shifts."
        }
      ]
    }
  ]
}